---------------------------------------------------------------------------------------------------------
-- Trace file location
---------------------------------------------------------------------------------------------------------
select * from v$parameter where name = 'user_dump_dest';

--WEEK12RU
--/snap_ssd_week12ru/oracle/WEEK12RU/11.2.0/admin/WEEK12RU_appstest04/diag/rdbms/week12ru/WEEK12RU/trace

--EVPD12RU
--/snap_ssd_evpd12ru/oracle/EVPD12RU/11.2.0/admin/EVPD12RU_appstest04/diag/rdbms/evpd12ru/EVPD12RU/trace

ls -ltr

---------------------------------------------------------------------------------------------------------
--Трассировка конкарента
---------------------------------------------------------------------------------------------------------
select oracle_process_id from apps.fnd_concurrent_requests where request_id=9505885

cd <user_dump_dest>
ls -ltr *<oracle_process_id>*


---------------------------------------------------------------------------------------------------------
--Трассировка сессии пользователя в OEBS
---------------------------------------------------------------------------------------------------------
-- Профиль:  Инициализирующая инструкция SQL - пользовательская (FND_INIT_SQL)
-- В зачение пользователя указать:

begin fnd_ctl.fnd_sess_ctl('','','TRUE','TRUE','LOG','ALTER SESSION SET EVENTS ='' 10046 TRACE NAME CONTEXT FOREVER, LEVEL 12'' TRACEFILE_IDENTIFIER='''||fnd_global.user_name||'_EXT'''); end;

-- Где _EXT - суффикс для удобства поиска файла


---------------------------------------------------------------------------------------------------------
--Трассировка сессии
---------------------------------------------------------------------------------------------------------
alter session set events =' 10046 TRACE NAME CONTEXT FOREVER, LEVEL 12' tracefile_identifier='WF_SKRYABIN_DG'


---------------------------------------------------------------------------------------------------------
--Tabular Statistics in TKPROF
---------------------------------------------------------------------------------------------------------
--https://docs.oracle.com/cd/B10500_01/server.920/a96533/sqltrace.htm#1317